PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
   /* Low-power handle */
   g_lp.hspi_cc1101 = &hspi1;
   g_lp.hspi_cc2500 = &hspi2;
   g_lp.gdo0_port   = g_cc2500.gdo0_port;
   g_lp.gdo0_pin    = g_cc2500.gdo0_pin;
   g_lp.gdo0_irqn   = EXTI1_IRQn;
   g_lp.hrtc         = &hrtc;

   LP_Init(&g_lp);

   /* Initialize CC2500 in wake-up mode */
   CC2500_InitWakeUp26MHz(&g_cc2500);

   /* Initialize CC1101 in MICS mode */
   CC1101_InitMICSLike26MHz(&g_cc1101);
}

/* ========================================================================== */
/* Allocate next session ID (skips reserved values)                            */
/* ========================================================================== */
static uint8_t Master_AllocateSession(void)
{
   uint8_t s = g_next_sess++;
   if (g_next_sess == PROTO_SESS_BROADCAST) {
       g_next_sess = 1U; /* skip 0x00 and 0xFF */
   }
   if (s == PROTO_SESS_UNASSIGNED) {
       s = 1U;
   }
   return s;
}

static uint32_t Master_Mac32(const uint8_t *buf, uint8_t len)
{
   uint32_t h = 2166136261UL;
   for (uint8_t i = 0U; i < sizeof(g_auth_key); i++) {
       h ^= g_auth_key[i];
       h *= 16777619UL;
   }
   for (uint8_t i = 0U; i < len; i++) {
       h ^= buf[i];
       h *= 16777619UL;
   }
   return h;
}

static void Master_BuildPollAuthArgs(uint8_t sess, uint8_t out[AUTH_ARG_LEN])
{
   uint32_t t = HAL_GetTick() ^ (((uint32_t)g_seq) << 24) ^ ((uint32_t)sess << 16);
   g_poll_nonce[0] = (uint8_t)(t & 0xFFU);
   g_poll_nonce[1] = (uint8_t)((t >> 8) & 0xFFU);
   g_poll_nonce[2] = (uint8_t)((t >> 16) & 0xFFU);
   g_poll_nonce[3] = (uint8_t)((t >> 24) & 0xFFU);

   memcpy(out, g_poll_nonce, AUTH_NONCE_LEN);

   uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
   mac_input[0] = sess;
   memcpy(&mac_input[1], g_target_id, PROTO_DEVICE_ID_LEN);
   memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_master_id, PROTO_MASTER_ID_LEN);
   memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], g_poll_nonce, AUTH_NONCE_LEN);

   uint32_t tag = Master_Mac32(mac_input, sizeof(mac_input));
   out[4] = (uint8_t)(tag & 0xFFU);
   out[5] = (uint8_t)((tag >> 8) & 0xFFU);
   out[6] = (uint8_t)((tag >> 16) & 0xFFU);
   out[7] = (uint8_t)((tag >> 24) & 0xFFU);
}

static bool Master_VerifyPollDataAuth(const Proto_Packet *pkt, uint8_t body_off)
{
   if (pkt->payload_len < (uint8_t)(body_off + AUTH_ARG_LEN)) {
       return false;
   }

   const uint8_t *nonce = &pkt->payload[body_off];
   const uint8_t *tag_b = &pkt->payload[body_off + AUTH_NONCE_LEN];

   if (memcmp(nonce, g_poll_nonce, AUTH_NONCE_LEN) != 0) {
       return false;
   }

   uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + AUTH_NONCE_LEN];
   mac_input[0] = g_session_id;
   memcpy(&mac_input[1], g_target_id, PROTO_DEVICE_ID_LEN);
   memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_master_id, PROTO_MASTER_ID_LEN);
   memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN], nonce, AUTH_NONCE_LEN);

   uint32_t expect = Master_Mac32(mac_input, sizeof(mac_input));
   uint32_t got = ((uint32_t)tag_b[0]) |
                  ((uint32_t)tag_b[1] << 8) |
                  ((uint32_t)tag_b[2] << 16) |
                  ((uint32_t)tag_b[3] << 24);
   return expect == got;
}

static bool Master_VerifyStreamDataAuth(const Proto_Packet *pkt, uint8_t body_off)
{
    if (pkt->payload_len < (uint8_t)(body_off + STREAM_AUTH_LEN + 4U)) {
        return false;
    }
 
    const uint8_t *frame_ctr = &pkt->payload[body_off];
    const uint8_t *tag_b = &pkt->payload[body_off + STREAM_FRAME_COUNTER_LEN];
    const uint8_t *stream_meta = &pkt->payload[body_off + STREAM_AUTH_LEN];
    uint8_t logical_len = stream_meta[3];
    if (pkt->payload_len < (uint8_t)(body_off + STREAM_AUTH_LEN + 4U + logical_len)) {
        return false;
    }
 
    uint8_t mac_input[1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + STREAM_FRAME_COUNTER_LEN + 4U + STREAM_LOGICAL_DATA_MAX];
    mac_input[0] = g_session_id;
    memcpy(&mac_input[1], g_target_id, PROTO_DEVICE_ID_LEN);
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN], g_master_id, PROTO_MASTER_ID_LEN);
    mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN] = frame_ctr[0];
    mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + 1U] = frame_ctr[1];
    memcpy(&mac_input[1 + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + STREAM_FRAME_COUNTER_LEN],
           stream_meta,
           (uint8_t)(4U + logical_len));
 
    uint32_t expect = Master_Mac32(mac_input,
                                   (uint8_t)(1U + PROTO_DEVICE_ID_LEN + PROTO_MASTER_ID_LEN + STREAM_FRAME_COUNTER_LEN + 4U + logical_len));
    uint32_t got = ((uint32_t)tag_b[0]) |
                   ((uint32_t)tag_b[1] << 8) |
                   ((uint32_t)tag_b[2] << 16) |
                   ((uint32_t)tag_b[3] << 24);
    return expect == got;
}

static bool Master_StreamReasmIngest(Master_StreamReassembly *ctx,
                                    uint8_t stream_seq,
                                    uint8_t copy_idx,
                                    uint8_t copy_total,
                                    const uint8_t *logical_data,
                                    uint8_t logical_len)
{
   if ((ctx == NULL) || (logical_data == NULL) || (logical_len > STREAM_LOGICAL_DATA_MAX)) {
       return false;
   }
   if (copy_total != STREAM_FEC_COPIES) {
       return false;
   }

   if ((!ctx->active) || (ctx->stream_seq != stream_seq)) {
       memset(ctx, 0, sizeof(*ctx));
       ctx->active = true;
       ctx->stream_seq = stream_seq;
       ctx->logical_len = logical_len;
   }

   if (ctx->logical_len != logical_len) {
       return false;
   }
   if (copy_idx >= STREAM_FEC_COPIES) {
       return false;
   }

   memcpy(ctx->logical_data, logical_data, logical_len);
   ctx->copy_mask |= (uint8_t)(1U << copy_idx);
   return true;
}

static bool Master_StreamReasmComplete(const Master_StreamReassembly *ctx)
{
   if ((ctx == NULL) || (!ctx->active)) {
       return false;
   }
   return ctx->copy_mask != 0U; /* any one of 5 copies is sufficient */
}

static void Master_HandleLogicalData(const uint8_t *logical_data, uint8_t logical_len)
{
   if ((logical_data == NULL) || (logical_len < 4U)) {
       return;
   }

   uint8_t stream_seq = logical_data[0];
   uint8_t app_type   = logical_data[1];
   uint8_t sub_type   = logical_data[2];
   uint8_t payload_len = logical_data[3];
   if (logical_len < (uint8_t)(4U + payload_len)) {
       return;
   }

