PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
   g_app_rx.last_stream_seq = stream_seq;

   switch (app_type) {
   case PROTO_APP_TYPE_WAVEFORM:
       g_app_rx.last_waveform_kind = sub_type;
       g_app_rx.last_waveform_len =
           (payload_len > sizeof(g_app_rx.last_waveform_payload))
           ? (uint8_t)sizeof(g_app_rx.last_waveform_payload)
           : payload_len;
       memcpy(g_app_rx.last_waveform_payload, &logical_data[4], g_app_rx.last_waveform_len);
       break;

   case PROTO_APP_TYPE_MEASUREMENT:
       g_app_rx.last_meas_bitmap = sub_type;
       memcpy(g_app_rx.last_meas_payload, &logical_data[4],
              (payload_len > sizeof(g_app_rx.last_meas_payload))
              ? sizeof(g_app_rx.last_meas_payload)
              : payload_len);
       break;

   case PROTO_APP_TYPE_EVENT:
       g_app_rx.last_event_code = sub_type;
       g_app_rx.last_event_len =
           (payload_len > sizeof(g_app_rx.last_event_payload))
           ? (uint8_t)sizeof(g_app_rx.last_event_payload)
           : payload_len;
       memcpy(g_app_rx.last_event_payload, &logical_data[4], g_app_rx.last_event_len);
       break;

   default:
       break;
   }
}

static int Master_SendStreamNack(uint8_t missing_from_seq)
{
   uint8_t nack_args[1] = { missing_from_seq };
   Proto_Packet nack_pkt;
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];

   nack_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, true, false);
   nack_pkt.seq  = g_seq++;
   nack_pkt.sess = g_session_id;
   nack_pkt.payload_len = Proto_BuildCommandPayload(CMD_STREAM_NACK,
                                                    g_target_id,
                                                    g_master_id,
                                                    nack_args, (uint8_t)sizeof(nack_args),
                                                    nack_pkt.payload,
                                                    sizeof(nack_pkt.payload));
   if (nack_pkt.payload_len == 0U) {
       return -1;
   }
   uint8_t tx_len = Proto_BuildPacket(&nack_pkt, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -1;
   }
   return (Master_TxLBT_SameChannel(tx_buf, tx_len) == CC1101_OK) ? 0 : -2;
}

static int Master_ConfigureStreamViaDataWrite(uint8_t interval_ms, uint8_t frame_count)
{
   uint8_t cfg[3];
   cfg[0] = STREAM_CFG_SUBCMD;
   cfg[1] = interval_ms;
   cfg[2] = frame_count;
   return Master_WriteToImplant(cfg, (uint8_t)sizeof(cfg));
}

static int Master_StreamFromImplant(uint8_t interval_ms, uint8_t frame_count)
{
   if (frame_count == 0U) {
       return 0;
   }

   uint8_t start_args[AUTH_ARG_LEN + 2U];
   Master_BuildPollAuthArgs(g_session_id, start_args);
   start_args[AUTH_ARG_LEN] = interval_ms;
   start_args[AUTH_ARG_LEN + 1U] = frame_count;

   Proto_Packet start_pkt;
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_len = 0U;

   start_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, true, false);
   start_pkt.seq  = g_seq++;
   start_pkt.sess = g_session_id;
   start_pkt.payload_len = Proto_BuildCommandPayload(CMD_STREAM_START,
                                                     g_target_id,
                                                     g_master_id,
                                                     start_args, (uint8_t)sizeof(start_args),
                                                     start_pkt.payload,
                                                     sizeof(start_pkt.payload));
   if (start_pkt.payload_len == 0U) {
       return -1;
   }
   uint8_t tx_len = Proto_BuildPacket(&start_pkt, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -1;
   }
   if (Master_TxLBT_SameChannel(tx_buf, tx_len) != CC1101_OK) {
       return -2;
   }

   /* Wait command ACK for stream start */
   if (CC1101_WaitAndReadPacket(&g_cc1101, g_active_channel,
                                rx_buf, &rx_len, sizeof(rx_buf),
                                PROTO_MICS_RESP_TIMEOUT_MS) != CC1101_OK) {
       return -3;
   }

   Proto_Packet ack;
   if (Proto_ParsePacket(rx_buf, rx_len, &ack) < 0) {
       return -4;
   }
   if (!Proto_MatchSession(ack.sess, g_session_id)) {
       return -5;
   }
   if (g_last_rx_seq_valid && !Proto_IsSeqNewer(ack.seq, g_last_rx_seq)) {
       return -6;
   }
   g_last_rx_seq = ack.seq;
   g_last_rx_seq_valid = true;

   if (Proto_FCF_Type(ack.fcf) != MICS_FCF_TYPE_COMMAND) {
       return -7;
   }
   if (!Proto_VerifyPayloadDeviceID(&ack, PROTO_CMD_DEVID_OFFSET, g_target_id) ||
       !Proto_VerifyPayloadMasterID(&ack, PROTO_CMD_MASTERID_OFFSET, g_master_id)) {
       return -8;
   }
   if (ack.payload_len < (PROTO_CMD_ARGS_OFFSET + 1U) ||
       ack.payload[PROTO_CMD_SUBCMD_OFFSET] != CMD_STREAM_ACK ||
       ack.payload[PROTO_CMD_ARGS_OFFSET] != PROTO_STATUS_OK) {
       return -9;
   }

   /* Receive pushed stream DATA copies and recover logical frames */
   uint8_t received = 0U;
   bool stream_seq_valid = false;
   uint8_t last_stream_seq = 0U;
   bool frame_ctr_valid = false;
   uint16_t last_frame_ctr = 0U;
   Master_StreamReassembly reasm = {0};
   while (received < frame_count) {
       if (CC1101_WaitAndReadPacket(&g_cc1101, g_active_channel,
                                    rx_buf, &rx_len, sizeof(rx_buf),
                                    PROTO_MICS_RESP_TIMEOUT_MS) != CC1101_OK) {
           return -10;
       }
       Proto_Packet data_pkt;
       if (Proto_ParsePacket(rx_buf, rx_len, &data_pkt) < 0) {
           continue;
       }
       if (!Proto_MatchSession(data_pkt.sess, g_session_id)) {
           continue;
       }
       if (g_last_rx_seq_valid && !Proto_IsSeqNewer(data_pkt.seq, g_last_rx_seq)) {
           continue;
       }
       g_last_rx_seq = data_pkt.seq;
       g_last_rx_seq_valid = true;

       if (Proto_FCF_Type(data_pkt.fcf) != MICS_FCF_TYPE_DATA) {
           continue;
       }
       if (!Proto_VerifyPayloadDeviceID(&data_pkt, PROTO_DATA_DEVID_OFFSET, g_target_id) ||
           !Proto_VerifyPayloadMasterID(&data_pkt, PROTO_DATA_MASTERID_OFFSET, g_master_id)) {
           continue;
       }
       if (!Master_VerifyStreamDataAuth(&data_pkt, PROTO_DATA_BODY_OFFSET)) {
           continue;
       }
       /* DATA body(copy-FEC mode):
        * frame_counter(2) + TAG(4) + stream_seq(1) + copy_idx(1) + copy_total(1) + logical_len(1) + logical_data */       if (data_pkt.payload_len < (uint8_t)(PROTO_DATA_BODY_OFFSET + STREAM_AUTH_LEN + 4U)) {
       if (data_pkt.payload_len < (uint8_t)(PROTO_DATA_BODY_OFFSET + STREAM_AUTH_LEN + 4U)) {
            continue;
       }
       uint16_t frame_ctr = ((uint16_t)data_pkt.payload[PROTO_DATA_BODY_OFFSET]) |
                            ((uint16_t)data_pkt.payload[PROTO_DATA_BODY_OFFSET + 1U] << 8);
       if (frame_ctr_valid) {
           uint16_t delta = (uint16_t)(frame_ctr - last_frame_ctr);
           if ((delta == 0U) || (delta > 32768U)) {
               continue; /* duplicate / old frame counter */
           }
       }
       uint8_t stream_seq = data_pkt.payload[PROTO_DATA_BODY_OFFSET + STREAM_AUTH_LEN];
       uint8_t copy_idx = data_pkt.payload[PROTO_DATA_BODY_OFFSET + STREAM_AUTH_LEN + 1U];
       uint8_t copy_total = data_pkt.payload[PROTO_DATA_BODY_OFFSET + STREAM_AUTH_LEN + 2U];
       uint8_t logical_len = data_pkt.payload[PROTO_DATA_BODY_OFFSET + STREAM_AUTH_LEN + 3U];
       uint8_t logical_data_off = (uint8_t)(PROTO_DATA_BODY_OFFSET + STREAM_AUTH_LEN + 4U);
       if (data_pkt.payload_len < (uint8_t)(logical_data_off + logical_len)) {
           continue;
       }
       if (!Master_StreamReasmIngest(&reasm, stream_seq, copy_idx, copy_total,
                                     &data_pkt.payload[logical_data_off], logical_len)) {
           continue;
       }

       if (stream_seq_valid) {
           uint8_t expected = (uint8_t)(last_stream_seq + 1U);
           if (stream_seq != expected) {
#if STREAM_USE_OPTIONAL_NACK
               uint8_t gap = (uint8_t)(stream_seq - expected);
               if (gap >= STREAM_NACK_MIN_GAP) {
                   (void)Master_SendStreamNack(expected);
               }
#endif
           }
       }

       if (Master_StreamReasmComplete(&reasm)) {
           Master_HandleLogicalData(reasm.logical_data, reasm.logical_len);
           last_stream_seq = stream_seq;
           stream_seq_valid = true;
           frame_ctr_valid = true;
           last_frame_ctr = frame_ctr;
           received++;
           memset(&reasm, 0, sizeof(reasm));
       }
   }

