PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
   return 0;
}

/* ========================================================================== */
/* Same-channel LBT helper (Patch B)                                            */
/*                                                                              */
/* Retries CCA on g_active_channel up to MASTER_SAME_CH_RETRIES times with a    */
/* small back-off between attempts. Unlike CC1101_SendPacketLBT_Agile this      */
/* NEVER hops to a different channel, so the Slave stays in sync with the       */
/* channel it was told to camp on in the wake-up beacon.                        */
/* Returns CC1101_OK on successful TX, CC1101_ERR_CCA if every attempt failed.  */
/* ========================================================================== */
static CC1101_Status Master_TxLBT_SameChannel(const uint8_t *tx_buf,
                                             uint8_t tx_len)
{
   CC1101_Status st = CC1101_ERR_CCA;
   for (uint8_t attempt = 0U; attempt < MASTER_SAME_CH_RETRIES; attempt++) {
       st = CC1101_SendPacketLBT(&g_cc1101,
                                 g_active_channel,
                                 tx_buf, tx_len,
                                 CC1101_MICS_LBT_THRESHOLD_DBM,
                                 CC1101_MICS_LBT_LISTEN_MS,
                                 200U);
       if (st == CC1101_OK) {
           return CC1101_OK;
       }
       if (st != CC1101_ERR_CCA) {
           /* Non-CCA failure (SPI / HW) - retry won't help */
           return st;
       }
       /* Pseudo-random back-off: mix seq counter with attempt index to
        * de-correlate colliding Masters. Bounded: [MASTER_SAME_CH_BACKOFF_MS
        * .. MASTER_SAME_CH_BACKOFF_MS + 7]. */
       uint32_t jitter = ((uint32_t)g_seq + attempt) & 0x07U;
       HAL_Delay(MASTER_SAME_CH_BACKOFF_MS + jitter);
   }
   return st;   /* CC1101_ERR_CCA */
}

/* ========================================================================== */
/* Phase 1: Wake-up via CC2500 (2.4 GHz)                                      */
/* ========================================================================== */

static int Master_WakeUpImplant(void)
{
   uint8_t tx_buf[CC2500_PKT_MAX_LEN];
   uint8_t rx_buf[CC2500_PKT_MAX_LEN];
   uint8_t rx_len = 0U;

   /* 1) Run LBT on CC1101 *before* sending the beacon so we can tell the
    *    Slave which MICS channel to tune to. This eliminates Slave-side
    *    channel scanning and its battery cost. */
   int8_t free_ch = CC1101_FindFreeChannel(&g_cc1101,
                                           CC1101_MICS_LBT_THRESHOLD_DBM,
                                           CC1101_MICS_LBT_LISTEN_MS);
   if (free_ch < 0) {
       return -1;   /* all MICS channels busy - retry later */
   }
   g_active_channel = (uint8_t)free_ch;

   /* 2) Propose a new SESS for this session */
   uint8_t proposed_sess = Master_AllocateSession();

   /* 3) Build beacon MAC PDU:
    *    FCF  = COMMAND | ACK_REQ
    *    SESS = BROADCAST (session not yet established)
    *    PAYLOAD[0]    = DTYPE_COMMAND
    *    PAYLOAD[1]    = CMD_WAKEUP_REQ
    *    PAYLOAD[2..5] = target DEVICE_ID
    *    PAYLOAD[6..9] = MASTER_ID (authenticator)
    *    PAYLOAD[10]   = proposed SESS
    *    PAYLOAD[11]   = assigned MICS channel (from LBT)
    *    PAYLOAD[12]   = flags
    */
   Proto_Packet beacon_pkt;
   beacon_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, true, false);
   beacon_pkt.seq  = g_seq++;
   beacon_pkt.sess = PROTO_SESS_BROADCAST;
   beacon_pkt.payload_len = Proto_BuildBeaconPayload(CMD_WAKEUP_REQ,
                                                     g_target_id,
                                                     g_master_id,
                                                     proposed_sess,
                                                     g_active_channel,
                                                     0U,
                                                     beacon_pkt.payload,
                                                     sizeof(beacon_pkt.payload));
   if (beacon_pkt.payload_len == 0U) {
       return -2;
   }

   uint8_t tx_len = Proto_BuildPacket(&beacon_pkt, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -2;
   }

   /* 4) Repeatedly transmit the beacon so at least one WOR window catches it */
   CC2500_Status st = CC2500_SendWakeUpBeacon(&g_cc2500,
                                              tx_buf, tx_len,
                                              PROTO_WAKEUP_BEACON_REPEAT);
   if (st != CC2500_OK) {
       return -3;
   }

   /* 5) Wait for wake-up ACK on the same channel */
   st = CC2500_WaitAndReadPacket(&g_cc2500,
                                 CC2500_WAKEUP_CHANNEL,
                                 rx_buf, &rx_len,
                                 sizeof(rx_buf),
                                 PROTO_WAKEUP_ACK_TIMEOUT_MS);
   if (st != CC2500_OK) {
       return -4;
   }

   /* 6) Parse and verify ACK:
    *    - FCF type = COMMAND
    *    - payload[1]    = CMD_WAKEUP_ACK
    *    - payload[2..5] = our target DEVICE_ID
    *    - payload[6..9] = echoed MASTER_ID (must match g_master_id)
    *    - payload[10]   = echoed SESS (must match proposed_sess)
    *    - payload[11]   = echoed CHANNEL (must match g_active_channel)
    */
   Proto_Packet ack_pkt;
   if (Proto_ParsePacket(rx_buf, rx_len, &ack_pkt) < 0) {
       return -5;
   }
   if (Proto_FCF_Type(ack_pkt.fcf) != MICS_FCF_TYPE_COMMAND) {
       return -6;
   }
   if (ack_pkt.payload_len < PROTO_BEACON_PAYLOAD_LEN) {
       return -7;
   }
   if (ack_pkt.payload[PROTO_BEACON_CMD_OFFSET] != CMD_WAKEUP_ACK) {
       return -8;
   }
   if (!Proto_MatchDeviceID_Strict(&ack_pkt.payload[PROTO_BEACON_DEVID_OFFSET],
                                   g_target_id)) {
       return -9;
   }
   /* MASTER_ID echo proves the Slave really received OUR wake-up beacon
    * (and not a concurrent Master that happens to use the same DEVICE_ID). */
   if (!Proto_VerifyPayloadMasterID(&ack_pkt,
                                    PROTO_BEACON_MASTERID_OFFSET,
                                    g_master_id)) {
       return -10;
   }
   if (ack_pkt.payload[PROTO_BEACON_SESS_OFFSET] != proposed_sess) {
       return -11;
   }
   if (ack_pkt.payload[PROTO_BEACON_CHANNEL_OFFSET] != g_active_channel) {
       return -12;  /* Slave didn't acknowledge the assigned channel */
   }

   /* 7) Session established */
   g_session_id = proposed_sess;
   g_last_rx_seq_valid = false;
   return 0;
}

/* ========================================================================== */
/* Phase 2: Data communication via CC1101 (400 MHz MICS)                       */
/* ========================================================================== */

static int Master_PollImplantData(uint8_t *resp_buf, uint8_t *resp_len)
{
   Proto_Packet poll_pkt;
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_len = 0U;

