PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
   /* Build POLL request:
    *   FCF  = COMMAND | ACK_REQ
    *   SESS = established session
    *   payload = [DTYPE_COMMAND, CMD_POLL_REQ, DEVICE_ID[4], MASTER_ID[4]]
    *   DEVICE_ID + MASTER_ID jointly prove to Slave that this Master is the
    *   same authenticated peer that handed off identity during the 2.4 GHz
    *   wake-up handshake.
    */
   poll_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, true, false);
   poll_pkt.seq  = g_seq++;
   poll_pkt.sess = g_session_id;
   uint8_t auth_args[AUTH_ARG_LEN];
   Master_BuildPollAuthArgs(g_session_id, auth_args);
   poll_pkt.payload_len = Proto_BuildCommandPayload(CMD_POLL_REQ,
                                                    g_target_id,
                                                    g_master_id,
                                                    auth_args, AUTH_ARG_LEN,
                                                    poll_pkt.payload,
                                                    sizeof(poll_pkt.payload));
   if (poll_pkt.payload_len == 0U) {
       return -1;
   }

   uint8_t tx_len = Proto_BuildPacket(&poll_pkt, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -1;
   }

   /* Same-channel LBT: retry CCA on the pre-announced channel, do NOT hop.
    * If every retry fails, caller restarts the session (new LBT channel). */
   CC1101_Status st = Master_TxLBT_SameChannel(tx_buf, tx_len);
   if (st != CC1101_OK) {
       return -2;
   }

   /* Wait for response on the same channel */
   st = CC1101_WaitAndReadPacket(&g_cc1101,
                                 g_active_channel,
                                 rx_buf, &rx_len,
                                 sizeof(rx_buf),
                                 PROTO_MICS_RESP_TIMEOUT_MS);
   if (st != CC1101_OK) {
       return -3;
   }

   /* Parse response */
   Proto_Packet resp_pkt;
   if (Proto_ParsePacket(rx_buf, rx_len, &resp_pkt) < 0) {
       return -4;
   }
   if (!Proto_MatchSession(resp_pkt.sess, g_session_id)) {
       return -5;
   }
   if (g_last_rx_seq_valid && !Proto_IsSeqNewer(resp_pkt.seq, g_last_rx_seq)) {
       return -6; /* replay/duplicate/out-of-order */
   }
   g_last_rx_seq = resp_pkt.seq;
   g_last_rx_seq_valid = true;

   /* Verify DEVICE_ID + MASTER_ID in payload.
    * Triple-check (SESS + DEVICE_ID + MASTER_ID) confirms the response
    * originates from the Slave we woke up AND is bound to this Master. */
   uint8_t ftype = Proto_FCF_Type(resp_pkt.fcf);
   uint8_t devid_off, masterid_off, body_off;

   if (ftype == MICS_FCF_TYPE_DATA) {
       devid_off    = PROTO_DATA_DEVID_OFFSET;
       masterid_off = PROTO_DATA_MASTERID_OFFSET;
       body_off     = PROTO_DATA_BODY_OFFSET;
   } else if (ftype == MICS_FCF_TYPE_COMMAND) {
       devid_off    = PROTO_CMD_DEVID_OFFSET;
       masterid_off = PROTO_CMD_MASTERID_OFFSET;
       body_off     = PROTO_CMD_ARGS_OFFSET;
   } else {
       return -7;
   }

   if (!Proto_VerifyPayloadDeviceID(&resp_pkt, devid_off, g_target_id)) {
       return -8;  /* Device ID mismatch - possible spoofer or wrong Slave */
   }
   if (!Proto_VerifyPayloadMasterID(&resp_pkt, masterid_off, g_master_id)) {
       return -9;  /* Slave is echoing a different Master's ID - reject */
   }

   /* Copy application body to caller */
   if (resp_pkt.payload_len < body_off) {
       return -10;
   }
   if (ftype == MICS_FCF_TYPE_DATA && !Master_VerifyPollDataAuth(&resp_pkt, body_off)) {
       return -11;
   }
   if ((resp_buf != NULL) && (resp_len != NULL)) {
       uint8_t data_off = body_off;
       if (ftype == MICS_FCF_TYPE_DATA) {
           data_off = (uint8_t)(data_off + AUTH_ARG_LEN);
       }
       uint8_t n = (uint8_t)(resp_pkt.payload_len - data_off);
       memcpy(resp_buf, &resp_pkt.payload[data_off], n);
       *resp_len = n;
   }

   return 0;
}

static int Master_WriteToImplant(const uint8_t *data, uint8_t len)
{
   Proto_Packet write_pkt;
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_len = 0U;

   /* Command payload overhead = DTYPE + SUBCMD + DEVID[4] + MASTERID[4] = 10 B */
   if ((data == NULL) || (len == 0U) ||
       (len > (PROTO_MAX_PAYLOAD - PROTO_CMD_HEADER_LEN))) {
       return -1;
   }

   /* Build DATA_WRITE packet with DEVICE_ID + MASTER_ID handoff */
   write_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, true, false);
   write_pkt.seq  = g_seq++;
   write_pkt.sess = g_session_id;
   write_pkt.payload_len = Proto_BuildCommandPayload(CMD_DATA_WRITE,
                                                     g_target_id,
                                                     g_master_id,
                                                     data, len,
                                                     write_pkt.payload,
                                                     sizeof(write_pkt.payload));
   if (write_pkt.payload_len == 0U) {
       return -2;
   }

   uint8_t tx_len = Proto_BuildPacket(&write_pkt, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -2;
   }

   /* Same-channel LBT retry (never hop - Slave is camped on this channel) */
   CC1101_Status st = Master_TxLBT_SameChannel(tx_buf, tx_len);
   if (st != CC1101_OK) {
       return -3;
   }

   /* Wait for DATA_ACK */
   st = CC1101_WaitAndReadPacket(&g_cc1101,
                                 g_active_channel,
                                 rx_buf, &rx_len,
                                 sizeof(rx_buf),
                                 PROTO_MICS_RESP_TIMEOUT_MS);
   if (st != CC1101_OK) {
       return -4;
   }

   Proto_Packet ack_pkt;
   if (Proto_ParsePacket(rx_buf, rx_len, &ack_pkt) < 0) {
       return -5;
   }
   if (!Proto_MatchSession(ack_pkt.sess, g_session_id)) {
       return -6;
   }
   if (g_last_rx_seq_valid && !Proto_IsSeqNewer(ack_pkt.seq, g_last_rx_seq)) {
       return -7;
   }
   g_last_rx_seq = ack_pkt.seq;
   g_last_rx_seq_valid = true;
   if (Proto_FCF_Type(ack_pkt.fcf) != MICS_FCF_TYPE_COMMAND) {
       return -8;
   }
   /* Verify DEVICE_ID + MASTER_ID handoff in ACK */
   if (!Proto_VerifyPayloadDeviceID(&ack_pkt, PROTO_CMD_DEVID_OFFSET,
                                    g_target_id)) {
       return -8;
   }
   if (!Proto_VerifyPayloadMasterID(&ack_pkt, PROTO_CMD_MASTERID_OFFSET,
                                    g_master_id)) {
       return -9;
   }
   if (ack_pkt.payload_len < (PROTO_CMD_ARGS_OFFSET + 1U)) {
       return -10;
   }
   if (ack_pkt.payload[PROTO_CMD_SUBCMD_OFFSET] != CMD_DATA_ACK) {
       return -11;
   }
   if (ack_pkt.payload[PROTO_CMD_ARGS_OFFSET] != PROTO_STATUS_OK) {
       return -12;
   }

