PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
   return 0;
}

/* ========================================================================== */
/* Phase 3: End session                                                        */
/* ========================================================================== */

static int Master_SendShipCommand(void)
{
   Proto_Packet ship_pkt;
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_len = 0U;
   uint8_t auth_args[AUTH_ARG_LEN];

   Master_BuildPollAuthArgs(g_session_id, auth_args);

   ship_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, false, false);
   ship_pkt.seq  = g_seq++;
   ship_pkt.sess = g_session_id;
   ship_pkt.payload_len = Proto_BuildCommandPayload(CMD_SHIP_CMD,
                                                    g_target_id,
                                                    g_master_id,
                                                    auth_args,
                                                    AUTH_ARG_LEN,
                                                    ship_pkt.payload,
                                                    sizeof(ship_pkt.payload));
   if (ship_pkt.payload_len == 0U) {
       return -1;
   }

   uint8_t tx_len = Proto_BuildPacket(&ship_pkt, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -1;
   }

   CC1101_Status st = Master_TxLBT_SameChannel(tx_buf, tx_len);
   if (st != CC1101_OK) {
       return -2;
   }

   st = CC1101_WaitAndReadPacket(&g_cc1101,
                                 g_active_channel,
                                 rx_buf, &rx_len,
                                 sizeof(rx_buf),
                                 PROTO_SLEEP_CONFIRM_TIMEOUT_MS);
   if (st != CC1101_OK) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -3;
   }

   Proto_Packet ack_pkt;
   if (Proto_ParsePacket(rx_buf, rx_len, &ack_pkt) < 0) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -4;
   }
   if (!Proto_MatchSession(ack_pkt.sess, g_session_id)) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -5;
   }
   if (g_last_rx_seq_valid && !Proto_IsSeqNewer(ack_pkt.seq, g_last_rx_seq)) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -6;
   }
   g_last_rx_seq = ack_pkt.seq;
   g_last_rx_seq_valid = true;
   if (Proto_FCF_Type(ack_pkt.fcf) != MICS_FCF_TYPE_COMMAND) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -7;
   }
   if (!Proto_VerifyPayloadDeviceID(&ack_pkt, PROTO_CMD_DEVID_OFFSET, g_target_id) ||
       !Proto_VerifyPayloadMasterID(&ack_pkt, PROTO_CMD_MASTERID_OFFSET, g_master_id)) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -8;
   }
   if (ack_pkt.payload_len < PROTO_CMD_HEADER_LEN) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -9;
   }
   if (ack_pkt.payload[PROTO_CMD_SUBCMD_OFFSET] != CMD_SHIP_ACK) {
       g_session_id = PROTO_SESS_UNASSIGNED;
       g_last_rx_seq_valid = false;
       return -10;
   }
   if (ack_pkt.payload_len > PROTO_CMD_HEADER_LEN) {
       if (ack_pkt.payload[PROTO_CMD_ARGS_OFFSET] != PROTO_STATUS_OK) {
           g_session_id = PROTO_SESS_UNASSIGNED;
           g_last_rx_seq_valid = false;
           return -11;
       }
   }

   g_session_id = PROTO_SESS_UNASSIGNED;
   g_last_rx_seq_valid = false;
   return 0;
}

static int Master_SendSleepCommand(void)
{
   Proto_Packet sleep_pkt;
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_len = 0U;

   sleep_pkt.fcf  = Proto_FCF_Make(MICS_FCF_TYPE_COMMAND, false, false);
   sleep_pkt.seq  = g_seq++;
   sleep_pkt.sess = g_session_id;
   sleep_pkt.payload_len = Proto_BuildCommandPayload(CMD_SLEEP_CMD,
                                                     g_target_id,
                                                     g_master_id,
                                                     NULL, 0U,
                                                     sleep_pkt.payload,
                                                     sizeof(sleep_pkt.payload));
   if (sleep_pkt.payload_len == 0U) {
       return -1;
   }

   uint8_t tx_len = Proto_BuildPacket(&sleep_pkt, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return -1;
   }

   /* Same-channel LBT retry (no hop) */
   CC1101_Status st = Master_TxLBT_SameChannel(tx_buf, tx_len);
   if (st != CC1101_OK) {
       return -2;
   }

   /* Optionally wait for SLEEP_ACK */
   st = CC1101_WaitAndReadPacket(&g_cc1101,
                                 g_active_channel,
                                 rx_buf, &rx_len,
                                 sizeof(rx_buf),
                                 PROTO_SLEEP_CONFIRM_TIMEOUT_MS);
   /* Even if ACK times out, implant will auto-sleep */
   (void)st;

   /* Invalidate session */
   g_session_id = PROTO_SESS_UNASSIGNED;
   g_last_rx_seq_valid = false;

   return 0;
}

/* ========================================================================== */
/* Full communication session                                                  */
/* ========================================================================== */

static int Master_CommunicationSession(void)
{
   int rc = -1;
   uint8_t data_buf[PROTO_MAX_PAYLOAD];
   uint8_t data_len = 0U;

   MASTER_LOG("[MASTER] session start\r\n");

   /* Outer session-restart loop (Patch B).
    *
    * If same-channel LBT keeps failing on the MICS channel we announced
    * during wake-up (another user has occupied it after our CCA), the
    * Slave is camped on a dead channel. Re-run wake-up from scratch:
    * LBT will pick a NEW free channel, the beacon will advertise it,
    * and the Slave will retune. Bounded by MASTER_SESSION_RESTARTS.
    */
   for (uint8_t attempt = 0U; attempt <= MASTER_SESSION_RESTARTS; attempt++) {
       /* Start each retry from a clean session state. */
       g_session_id = PROTO_SESS_UNASSIGNED;

       /* Phase 1: Wake up implant via 2.4 GHz (with fresh LBT each pass) */
       rc = Master_WakeUpImplant();
       if (rc != 0) {
           continue; /* try again from wake-up - Slave may have missed beacon */
       }

       /* Phase 2: Poll data via 400 MHz MICS */
       rc = Master_PollImplantData(data_buf, &data_len);
       if (rc == -2) {
           /* CCA failure on announced channel: the channel was occupied
            * after our LBT. Restart the session so we re-run LBT and
            * pick a different channel. Slave will session-timeout or be
            * re-woken with the new channel. */
           g_session_id = PROTO_SESS_UNASSIGNED;
           continue;
       }
       if (rc != 0) {
           /* Non-CCA failure (parse, auth, timeout) - end session cleanly */
           Master_SendSleepCommand();
           break;
       }

       /* Process received data (application-specific) */
       /* ... */

