PAKHYUNMOON/CC1101_CC2500/app/master/m_main.c
       /* Runtime stream control path:
        * 1) push stream config via DATA_WRITE
        * 2) trigger stream start with configured values */
       (void)Master_ConfigureStreamViaDataWrite(g_stream_interval_ms, g_stream_frame_count);
       (void)Master_StreamFromImplant(g_stream_interval_ms, g_stream_frame_count);

       /* Phase 3: End session — sleep (default) or ship/storage mode */
#if MASTER_SESSION_END_WITH_SHIP
       rc = Master_SendShipCommand();
#else
       Master_SendSleepCommand();
       rc = 0;
#endif
       break;
   }

   /* Put radios to sleep regardless of outcome */
   CC1101_EnterSleep(&g_cc1101);
   CC2500_EnterSleep(&g_cc2500);

    MASTER_LOG("[MASTER] session end rc=%d\r\n", rc);

   return rc;
}

/* ========================================================================== */
/* main                                                                        */
/* ========================================================================== */

int main(void)
{
   HAL_Init();

   /* SystemClock_Config() - generated by CubeMX */
   /* MX_GPIO_Init(), MX_SPI1_Init(), MX_SPI2_Init(), MX_RTC_Init() */

   Master_InitHardware();
   MASTER_LOG("[MASTER] boot ok (UART log=%d)\r\n", PROTO_MASTER_UART_LOG_ENABLE);

   while (1) {
       /*
        * Master (Programmer) is typically triggered by user action
        * (e.g., button press or host command).
        * Here we show a simple polling loop; in practice this would be
        * event-driven.
        */

       int result = Master_CommunicationSession();

       if (result == 0) {
           /* Session successful */
           HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);  /* LED on */
           MASTER_LOG("[MASTER] session success\r\n");
       } else {
           /* Session failed */
           HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
           MASTER_LOG("[MASTER] session fail rc=%d\r\n", result);
       }

       /* Wait before next session (or wait for user trigger) */
       HAL_Delay(5000U);
   }
}